org/lang/cpp.org
#+TITLE: C++ 点滴
#+KEYWORDS: c++
#+OPTIONS: H:3 toc:1 num:2 ^:nil
#+LANGUAGE: zh-CN
#+AUTHOR: ChrisChen
#+EMAIL: ChrisChen3121@gmail.com
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+SETUPFILE: ../../org-templates/level-1.org
* 对象初始化
  - 总是使用花括号进行初始化{}，原因：当隐式转换精度变小时编译器将会报错。
  #+BEGIN_SRC cpp
  double pi = 3.1415926536;
  int a(pi), b = pi; //丢失精度
  // int c{pi}, d = {pi}; //编译报错：good!
  #+END_SRC
* 指针和引用
** 常量指针和引用
   - 指向常量的指针没有规定其所指对象必须是一个常量(该值仍可以通过其他方式改变)。引用也一样。

** const 指针
   #+BEGIN_SRC cpp
    int val = 0;
    int val2 = 1;
    int *const pi = &val; //指向整形的常量指针 top-level const
    pi = &val2; // error: assignment of read-only variable ‘pi’

    const int *pci = &val; //指向常量整形的指针 low-level const
    *pci = 2; // error: assignment of read-only location ‘* pci’
   #+END_SRC

* 表达式
** 输入输出求值顺序
   #+BEGIN_SRC cpp
     int i{0};
     std::cout << i << " " << ++i << "\n"; //未定义
   #+END_SRC
** 递增递减运算符
   #+BEGIN_SRC cpp
     std::cout << *iter++ << "\n"; //先解引用后递增迭代器，常规简洁写法，记住。
     // 等价于
     std::cout << *iter << "\n";
     iter++;
   #+END_SRC
** sizeof 运算符
   sizeof 运算符返回一条表达式或一个类型名字所占的字节数
   #+BEGIN_SRC cpp
     sizeof(type)
     sizeof expr
   #+END_SRC
   - sizeof 并不实际计算其运算对象的值，编译期即可
   - 对 string 或 vector 对象使用，仅返回该类型固定部分的大小
* 函数
** 局部静态变量
   在程序第一次经过对象定义语句时初始化，直到程序结束才销毁。
   #+BEGIN_SRC cpp
     auto f() {
       static auto cst = 0; // 仅执行一次
       return ++cst;
     }
   #+END_SRC
   - 编译器保证局部静态变量线程安全，典型实现：Meyer's singleton
** 数组形参
   #+BEGIN_SRC cpp
     void f(const int *);
     void f(const int[]); //函数意图显而意见
     void f(const int[10]); //10 并不起作用，应通过额外的参数传数组长度
     void f(int (&arr)[10]); //数组引用形参
   #+END_SRC
** 可变参数形参
*** initializer_list
    同类型多参数
    #+BEGIN_SRC cpp
      void f(initializer_list<int> args);
      f({1, 2, 3});
    #+END_SRC
*** 可变参数模板
    #+BEGIN_SRC cpp
      template<typename... Args>
      void f(const Args& ... rest);
    #+END_SRC
** 列表初始化返回值
   #+BEGIN_SRC cpp
     vector<string> process() {
       return {"a", "b", "cd"};
     }
   #+END_SRC
** 尾置返回类型
   #+BEGIN_SRC cpp
     auto f(int i) -> int(*)[10];//返回指针，指向含有 10 个整数的数组
   #+END_SRC

