cpp/cpp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<!-- 2020-06-09 Tue 16:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C++ 点滴</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChrisChen" />
<meta name="keywords" content="c++" />
<link rel="stylesheet" type="text/css" href="../styles/demo/css/demo.css"/>
<link href="https://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">C++ 点滴</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org517f3ac">1. 对象初始化</a></li>
<li><a href="#org9f86984">2. 指针和引用</a></li>
<li><a href="#orgf39ba26">3. 表达式</a></li>
<li><a href="#orge83a332">4. 函数</a></li>
<li><a href="#orgef58621">5. 类</a></li>
<li><a href="#orga5c2035">6. 类型</a></li>
<li><a href="#orgc198792">7. 容器</a></li>
<li><a href="#org02bc99d">8. 智能指针</a></li>
<li><a href="#orgbd7180f">9. 移动语义</a></li>
<li><a href="#orge131ade">10. lambda</a></li>
<li><a href="#org9b700d1">11. 模板</a></li>
<li><a href="#org120e4c5">12. 辅助调试</a></li>
<li><a href="#org61e4279">13. 输入输出流</a></li>
<li><a href="#org7f070c9">14. string</a></li>
<li><a href="#org2f82e50">15. new &amp; delete</a></li>
<li><a href="#org855b9d8">16. 异常</a></li>
<li><a href="#org38cadc2">17. 标准库</a></li>
<li><a href="#orgd951717">18. 不可移植特性</a></li>
<li><a href="#orgfc7f72c">19. 类对象</a></li>
</ul>
</div>
</div>
<div id="outline-container-org517f3ac" class="outline-2">
<h2 id="org517f3ac"><span class="section-number-2">1</span> 对象初始化</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>总是使用花括号进行初始化{}，原因：当隐式转换精度变小时编译器将会报错。</li>
</ul>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">double</span> <span style="color: #715ab1;">pi</span> = 3.1415926536;
<span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #6c3163; font-weight: bold;">a</span>(pi), <span style="color: #715ab1;">b</span> = pi; <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#20002;&#22833;&#31934;&#24230;</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">int c{pi}, d = {pi}; //&#32534;&#35793;&#25253;&#38169;&#65306;good!</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9f86984" class="outline-2">
<h2 id="org9f86984"><span class="section-number-2">2</span> 指针和引用</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3fcba5f" class="outline-3">
<h3 id="org3fcba5f"><span class="section-number-3">2.1</span> 常量指针和引用</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>指向常量的指针没有规定其所指对象必须是一个常量(该值仍可以通过其他方式改变)。引用也一样。</li>
</ul>
</div>
</div>

<div id="outline-container-org3d572b0" class="outline-3">
<h3 id="org3d572b0"><span class="section-number-3">2.2</span> const 指针</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">val</span> = 0;
<span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">val2</span> = 1;
<span style="color: #ba2f59; font-weight: bold;">int</span> *<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #715ab1;">pi</span> = &amp;val; <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#25351;&#21521;&#25972;&#24418;&#30340;&#24120;&#37327;&#25351;&#38024; top-level const</span>
pi = &amp;val2; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">error: assignment of read-only variable &#8216;pi&#8217;</span>

<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">int</span> *<span style="color: #715ab1;">pci</span> = &amp;val; <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#25351;&#21521;&#24120;&#37327;&#25972;&#24418;&#30340;&#25351;&#38024; low-level const</span>
*pci = 2; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">error: assignment of read-only location &#8216;* pci&#8217;</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf39ba26" class="outline-2">
<h2 id="orgf39ba26"><span class="section-number-2">3</span> 表达式</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org7508b6c" class="outline-3">
<h3 id="org7508b6c"><span class="section-number-3">3.1</span> 输入输出求值顺序</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">i</span>{0};
<span style="color: #4e3163;">std</span>::cout &lt;&lt; i &lt;&lt; <span style="color: #2d9574;">" "</span> &lt;&lt; ++i &lt;&lt; <span style="color: #2d9574;">"\n"</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26410;&#23450;&#20041;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9a17971" class="outline-3">
<h3 id="org9a17971"><span class="section-number-3">3.2</span> 递增递减运算符</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4e3163;">std</span>::cout &lt;&lt; *iter++ &lt;&lt; <span style="color: #2d9574;">"\n"</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#20808;&#35299;&#24341;&#29992;&#21518;&#36882;&#22686;&#36845;&#20195;&#22120;&#65292;&#24120;&#35268;&#31616;&#27905;&#20889;&#27861;&#65292;&#35760;&#20303;&#12290;</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#31561;&#20215;&#20110;</span>
<span style="color: #4e3163;">std</span>::cout &lt;&lt; *iter &lt;&lt; <span style="color: #2d9574;">"\n"</span>;
iter++;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdcd6d6d" class="outline-3">
<h3 id="orgdcd6d6d"><span class="section-number-3">3.3</span> sizeof 运算符</h3>
<div class="outline-text-3" id="text-3-3">
<p>
sizeof 运算符返回一条表达式或一个类型名字所占的字节数
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">sizeof</span>(type)
<span style="color: #3a81c3; font-weight: bold;">sizeof</span> expr
</pre>
</div>
<ul class="org-ul">
<li>sizeof 并不实际计算其运算对象的值，编译期即可</li>
<li>对 string 或 vector 对象使用，仅返回该类型固定部分的大小</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge83a332" class="outline-2">
<h2 id="orge83a332"><span class="section-number-2">4</span> 函数</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org8a7e4a5" class="outline-3">
<h3 id="org8a7e4a5"><span class="section-number-3">4.1</span> 局部静态变量</h3>
<div class="outline-text-3" id="text-4-1">
<p>
在程序第一次经过对象定义语句时初始化，直到程序结束才销毁。
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #6c3163; font-weight: bold;">f</span>() {
  <span style="color: #3a81c3; font-weight: bold;">static</span> <span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">cst</span> = 0; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#20165;&#25191;&#34892;&#19968;&#27425;</span>
  <span style="color: #3a81c3; font-weight: bold;">return</span> ++cst;
}
</pre>
</div>
<ul class="org-ul">
<li>编译器保证局部静态变量线程安全，典型实现：Meyer's singleton</li>
</ul>
</div>
</div>
<div id="outline-container-orgcaa27cb" class="outline-3">
<h3 id="orgcaa27cb"><span class="section-number-3">4.2</span> 数组形参</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">f</span>(<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">int</span> *);
<span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">f</span>(<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">int</span>[]); <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#20989;&#25968;&#24847;&#22270;&#26174;&#32780;&#24847;&#35265;</span>
<span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">f</span>(<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">int</span>[10]); <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">10 &#24182;&#19981;&#36215;&#20316;&#29992;&#65292;&#24212;&#36890;&#36807;&#39069;&#22806;&#30340;&#21442;&#25968;&#20256;&#25968;&#32452;&#38271;&#24230;</span>
<span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">f</span>(<span style="color: #ba2f59; font-weight: bold;">int</span> (&amp;<span style="color: #715ab1;">arr</span>)[10]); <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#25968;&#32452;&#24341;&#29992;&#24418;&#21442;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb28070d" class="outline-3">
<h3 id="orgb28070d"><span class="section-number-3">4.3</span> 可变参数形参</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-org41f0b56" class="outline-4">
<h4 id="org41f0b56">initializer_list</h4>
<div class="outline-text-4" id="text-org41f0b56">
<p>
同类型多参数
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">f</span>(<span style="color: #ba2f59; font-weight: bold;">initializer_list</span>&lt;<span style="color: #ba2f59; font-weight: bold;">int</span>&gt; <span style="color: #715ab1;">args</span>);
f({1, 2, 3});
</pre>
</div>
</div>
</div>
<div id="outline-container-org69463a8" class="outline-4">
<h4 id="org69463a8">可变参数模板</h4>
<div class="outline-text-4" id="text-org69463a8">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">template</span>&lt;<span style="color: #3a81c3; font-weight: bold;">typename</span>... <span style="color: #ba2f59; font-weight: bold;">Args</span>&gt;
<span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">f</span>(<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">Args</span>&amp; ... <span style="color: #715ab1;">rest</span>);
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org56c3329" class="outline-3">
<h3 id="org56c3329"><span class="section-number-3">4.4</span> 列表初始化返回值</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">vector</span>&lt;<span style="color: #ba2f59; font-weight: bold;">string</span>&gt; <span style="color: #6c3163; font-weight: bold;">process</span>() {
  <span style="color: #3a81c3; font-weight: bold;">return</span> {<span style="color: #2d9574;">"a"</span>, <span style="color: #2d9574;">"b"</span>, <span style="color: #2d9574;">"cd"</span>};
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb8ff388" class="outline-3">
<h3 id="orgb8ff388"><span class="section-number-3">4.5</span> 尾置返回类型</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #6c3163; font-weight: bold;">f</span>(<span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">i</span>) -&gt; <span style="color: #ba2f59; font-weight: bold;">int</span>(*)[10];<span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#36820;&#22238;&#25351;&#38024;&#65292;&#25351;&#21521;&#21547;&#26377; 10 &#20010;&#25972;&#25968;&#30340;&#25968;&#32452;</span>
</pre>
</div>
</div>
</div>
