org/lang/cpp.org
** constexpr 函数
   能用于常量表达式的函数
   - 函数的返回值及所有形参类型必须是字面值类型
   - 函数体有且只有一条 return 语句
   #+BEGIN_SRC cpp
     constexpr int num() { return 42; }
   #+END_SRC
   - 编译时直接用结果值 42 替换对 num 的函数调用
** 函数指针
   #+BEGIN_SRC cpp
     bool (*pf)(int a);
     bool fn(int a) { return a == 1; }
     pf = fn;                  // & is optional
     pf(2);                    // (*pf)(2) is optional
     void usepf(bool fn(int)); // bool (*fn)(int) is optional
   #+END_SRC
*** 返回函数指针
    #+BEGIN_SRC cpp
      using fn = bool(int);     //函数类型
      using pf = bool (*)(int); //函数指针类型
      pf returnFn();            // OK
      fn returnFn();            // Wrong
      fn *returnFn();           // OK
      auto returnFn() -> bool (*)(int)
    #+END_SRC
*** 成员函数指针
    三种形式：
    #+BEGIN_SRC cpp
      auto a = std::mem_fn<int&()>(&X::get); //std::mem_fn 生成指向成员指针的包装对象
      auto b  = [] (X& x) {return x.get();};
      auto c = std::bind(&X::get, &x);
    #+END_SRC
** std::bind
   接受一个可调用对象，绑定若干参数，生成一个新的可调用对象。(函数柯里化)
   - 引用类型参数需用 std::ref 包装，常量引用使用 std::cref。

** 运算符函数化
   标准库提供了内置类型的函数形式的运算符，如 plus<int>, negate<int>等。主要用于给算法传递这些函数，例如：
   #+BEGIN_SRC cpp
     sort(svec.begin(), svec.end(), greater<string>());
   #+END_SRC

** std::function
   为了统一各种不同可调用对象之间(lambda，函数指针，重载调用运算符的类等)的同一调用形式(相同的函数签名)

* 类
** 隐式 inline
   在类定义中声明的成员函数为隐式 inline 函数

** 可变数据成员(mutable)
   使用关键字 mutable 定义 const 成员函数可以改变的数据成员，比如用于 const 函数调用计数
   #+BEGIN_SRC cpp
     class Test {
      public:
       void fn() const { count++; }; //count 可以被改变

      private:
       mutable int count = 0;
     };
   #+END_SRC
   fn 是一个对于外部来说的逻辑 const 函数，它所改变的内部状态不为外部“所知”(非接口可获取，内部缓存)

** explicit 构造
   抑制构造函数(拷贝和移动构造函数不算在内)定义的隐式转换

** 聚合类
   - 要求所有成员都为 public
   - 成员无默认初始化
   - 没有基类，没有 virtual
   #+BEGIN_SRC cpp
     struct Data {
       int id;
       string name;
     };
     Data data{1, "steve"};
   #+END_SRC

** 字面值常量类
*** 数据成员都是字面值类型的聚合类
*** 非聚合类
    - 数据成员必须是字面值类型
    - 数据成员初始值定义必须使用常量表达式
    - 至少有一个 constexpr 构造函数
    - 必须使用析构函数的默认定义

** 运算符重载
*** 递增递减运算符
    #+BEGIN_SRC cpp
      MyClass operator++(); //前置版本
      MyClass operator++(int); //后置版本
    #+END_SRC
*** 类型转换重载
    #+BEGIN_SRC cpp
      operator target_type() const; //隐式转换
      explicit operator target_type() const; //显示转换
    #+END_SRC

** 虚析构函数
   虚析构函数是为了解决基类的指针指向派生类对象，并用基类的指针删除派生类对象时产生的子类资源不释放的问题。

** dynamic_cast
   从父类转换成子类，使用 dynamic_cast 会在运行时检查转换是否有效，而 static_cast 不会

** 强制调用基类虚函数
   #+BEGIN_SRC cpp
     p_base->Base::fn();//使用作用域指定
   #+END_SRC
