cpp/cpp.html

<div id="outline-container-orgf82a27f" class="outline-3">
<h3 id="orgf82a27f"><span class="section-number-3">4.6</span> constexpr 函数</h3>
<div class="outline-text-3" id="text-4-6">
<p>
能用于常量表达式的函数
</p>
<ul class="org-ul">
<li>函数的返回值及所有形参类型必须是字面值类型</li>
<li>函数体有且只有一条 return 语句</li>
</ul>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">constexpr</span> <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #6c3163; font-weight: bold;">num</span>() { <span style="color: #3a81c3; font-weight: bold;">return</span> 42; }
</pre>
</div>
<ul class="org-ul">
<li>编译时直接用结果值 42 替换对 num 的函数调用</li>
</ul>
</div>
</div>
<div id="outline-container-org6c5cc1f" class="outline-3">
<h3 id="org6c5cc1f"><span class="section-number-3">4.7</span> 函数指针</h3>
<div class="outline-text-3" id="text-4-7">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">bool</span> (*<span style="color: #6c3163; font-weight: bold;">pf</span>)(<span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">a</span>);
<span style="color: #ba2f59; font-weight: bold;">bool</span> <span style="color: #6c3163; font-weight: bold;">fn</span>(<span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">a</span>) { <span style="color: #3a81c3; font-weight: bold;">return</span> a == 1; }
pf = fn;                  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&amp; is optional</span>
pf(2);                    <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">(*pf)(2) is optional</span>
<span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">usepf</span>(<span style="color: #ba2f59; font-weight: bold;">bool</span> <span style="color: #6c3163; font-weight: bold;">fn</span>(<span style="color: #ba2f59; font-weight: bold;">int</span>)); <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">bool (*fn)(int) is optional</span>
</pre>
</div>
</div>
<div id="outline-container-org9ed0657" class="outline-4">
<h4 id="org9ed0657">返回函数指针</h4>
<div class="outline-text-4" id="text-org9ed0657">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">using</span> <span style="color: #ba2f59; font-weight: bold;">fn</span> = <span style="color: #ba2f59; font-weight: bold;">bool</span>(<span style="color: #ba2f59; font-weight: bold;">int</span>);     <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#20989;&#25968;&#31867;&#22411;</span>
<span style="color: #3a81c3; font-weight: bold;">using</span> <span style="color: #ba2f59; font-weight: bold;">pf</span> = <span style="color: #ba2f59; font-weight: bold;">bool</span> (*)(<span style="color: #ba2f59; font-weight: bold;">int</span>); <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#20989;&#25968;&#25351;&#38024;&#31867;&#22411;</span>
<span style="color: #ba2f59; font-weight: bold;">pf</span> <span style="color: #6c3163; font-weight: bold;">returnFn</span>();            <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">OK</span>
<span style="color: #ba2f59; font-weight: bold;">fn</span> <span style="color: #6c3163; font-weight: bold;">returnFn</span>();            <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Wrong</span>
<span style="color: #ba2f59; font-weight: bold;">fn</span> *<span style="color: #6c3163; font-weight: bold;">returnFn</span>();           <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">OK</span>
<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #6c3163; font-weight: bold;">returnFn</span>() -&gt; <span style="color: #ba2f59; font-weight: bold;">bool</span> (*)(<span style="color: #ba2f59; font-weight: bold;">int</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org0f7b65a" class="outline-4">
<h4 id="org0f7b65a">成员函数指针</h4>
<div class="outline-text-4" id="text-org0f7b65a">
<p>
三种形式：
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">a</span> = <span style="color: #4e3163;">std</span>::mem_fn&lt;<span style="color: #ba2f59; font-weight: bold;">int</span>&amp;()&gt;(&amp;<span style="color: #4e3163;">X</span>::get); <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">std::mem_fn &#29983;&#25104;&#25351;&#21521;&#25104;&#21592;&#25351;&#38024;&#30340;&#21253;&#35013;&#23545;&#35937;</span>
<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">b</span>  = [] (<span style="color: #ba2f59; font-weight: bold;">X</span>&amp; <span style="color: #715ab1;">x</span>) {<span style="color: #3a81c3; font-weight: bold;">return</span> x.get();};
<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">c</span> = <span style="color: #4e3163;">std</span>::bind(&amp;<span style="color: #4e3163;">X</span>::get, &amp;x);
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org438ddde" class="outline-3">
<h3 id="org438ddde"><span class="section-number-3">4.8</span> std::bind</h3>
<div class="outline-text-3" id="text-4-8">
<p>
接受一个可调用对象，绑定若干参数，生成一个新的可调用对象。(函数柯里化)
</p>
<ul class="org-ul">
<li>引用类型参数需用 std::ref 包装，常量引用使用 std::cref。</li>
</ul>
</div>
</div>

<div id="outline-container-orgd8ad6c2" class="outline-3">
<h3 id="orgd8ad6c2"><span class="section-number-3">4.9</span> 运算符函数化</h3>
<div class="outline-text-3" id="text-4-9">
<p>
标准库提供了内置类型的函数形式的运算符，如 plus&lt;int&gt;, negate&lt;int&gt;等。主要用于给算法传递这些函数，例如：
</p>
<div class="org-src-container">
<pre class="src src-cpp">sort(svec.begin(), svec.end(), greater&lt;<span style="color: #ba2f59; font-weight: bold;">string</span>&gt;());
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a68d02" class="outline-3">
<h3 id="org9a68d02"><span class="section-number-3">4.10</span> std::function</h3>
<div class="outline-text-3" id="text-4-10">
<p>
为了统一各种不同可调用对象之间(lambda，函数指针，重载调用运算符的类等)的同一调用形式(相同的函数签名)
</p>
</div>
</div>
</div>

<div id="outline-container-orgef58621" class="outline-2">
<h2 id="orgef58621"><span class="section-number-2">5</span> 类</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgfd33c00" class="outline-3">
<h3 id="orgfd33c00"><span class="section-number-3">5.1</span> 隐式 inline</h3>
<div class="outline-text-3" id="text-5-1">
<p>
在类定义中声明的成员函数为隐式 inline 函数
</p>
</div>
</div>

<div id="outline-container-org6742f95" class="outline-3">
<h3 id="org6742f95"><span class="section-number-3">5.2</span> 可变数据成员(mutable)</h3>
<div class="outline-text-3" id="text-5-2">
<p>
使用关键字 mutable 定义 const 成员函数可以改变的数据成员，比如用于 const 函数调用计数
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">Test</span> {
 <span style="color: #3a81c3; font-weight: bold;">public</span>:
  <span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">fn</span>() <span style="color: #3a81c3; font-weight: bold;">const</span> { count++; }; <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">count &#21487;&#20197;&#34987;&#25913;&#21464;</span>

 <span style="color: #3a81c3; font-weight: bold;">private</span>:
  <span style="color: #3a81c3; font-weight: bold;">mutable</span> <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">count</span> = 0;
};
</pre>
</div>
<p>
fn 是一个对于外部来说的逻辑 const 函数，它所改变的内部状态不为外部“所知”(非接口可获取，内部缓存)
</p>
</div>
</div>

<div id="outline-container-org07adc93" class="outline-3">
<h3 id="org07adc93"><span class="section-number-3">5.3</span> explicit 构造</h3>
<div class="outline-text-3" id="text-5-3">
<p>
抑制构造函数(拷贝和移动构造函数不算在内)定义的隐式转换
</p>
</div>
</div>

<div id="outline-container-orgbaf9ccb" class="outline-3">
<h3 id="orgbaf9ccb"><span class="section-number-3">5.4</span> 聚合类</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li>要求所有成员都为 public</li>
<li>成员无默认初始化</li>
<li>没有基类，没有 virtual</li>
</ul>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">struct</span> <span style="color: #ba2f59; font-weight: bold;">Data</span> {
  <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">id</span>;
  <span style="color: #ba2f59; font-weight: bold;">string</span> <span style="color: #715ab1;">name</span>;
};
<span style="color: #ba2f59; font-weight: bold;">Data</span> <span style="color: #715ab1;">data</span>{1, <span style="color: #2d9574;">"steve"</span>};
</pre>
</div>
</div>
</div>

<div id="outline-container-org76f5a14" class="outline-3">
<h3 id="org76f5a14"><span class="section-number-3">5.5</span> 字面值常量类</h3>
<div class="outline-text-3" id="text-5-5">
</div>
<div id="outline-container-orgf957557" class="outline-4">
<h4 id="orgf957557">数据成员都是字面值类型的聚合类</h4>
</div>
<div id="outline-container-orge875ef1" class="outline-4">
<h4 id="orge875ef1">非聚合类</h4>
<div class="outline-text-4" id="text-orge875ef1">
<ul class="org-ul">
<li>数据成员必须是字面值类型</li>
<li>数据成员初始值定义必须使用常量表达式</li>
<li>至少有一个 constexpr 构造函数</li>
<li>必须使用析构函数的默认定义</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2eadcb8" class="outline-3">
<h3 id="org2eadcb8"><span class="section-number-3">5.6</span> 运算符重载</h3>
<div class="outline-text-3" id="text-5-6">
</div>
<div id="outline-container-org5f91c61" class="outline-4">
<h4 id="org5f91c61">递增递减运算符</h4>
<div class="outline-text-4" id="text-org5f91c61">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">MyClass</span> <span style="color: #3a81c3; font-weight: bold;">operator</span><span style="color: #6c3163; font-weight: bold;">++</span>(); <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#21069;&#32622;&#29256;&#26412;</span>
<span style="color: #ba2f59; font-weight: bold;">MyClass</span> <span style="color: #3a81c3; font-weight: bold;">operator</span><span style="color: #6c3163; font-weight: bold;">++</span>(<span style="color: #ba2f59; font-weight: bold;">int</span>); <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#21518;&#32622;&#29256;&#26412;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2ff38cf" class="outline-4">
<h4 id="org2ff38cf">类型转换重载</h4>
<div class="outline-text-4" id="text-org2ff38cf">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">operator</span> <span style="color: #ba2f59; font-weight: bold;">target_type</span>() <span style="color: #3a81c3; font-weight: bold;">const</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#38544;&#24335;&#36716;&#25442;</span>
<span style="color: #3a81c3; font-weight: bold;">explicit</span> <span style="color: #3a81c3; font-weight: bold;">operator</span> <span style="color: #ba2f59; font-weight: bold;">target_type</span>() <span style="color: #3a81c3; font-weight: bold;">const</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26174;&#31034;&#36716;&#25442;</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org90cac83" class="outline-3">
<h3 id="org90cac83"><span class="section-number-3">5.7</span> 虚析构函数</h3>
<div class="outline-text-3" id="text-5-7">
<p>
虚析构函数是为了解决基类的指针指向派生类对象，并用基类的指针删除派生类对象时产生的子类资源不释放的问题。
</p>
</div>
</div>

<div id="outline-container-org3c3ca44" class="outline-3">
<h3 id="org3c3ca44"><span class="section-number-3">5.8</span> dynamic_cast</h3>
<div class="outline-text-3" id="text-5-8">
<p>
从父类转换成子类，使用 dynamic_cast 会在运行时检查转换是否有效，而 static_cast 不会
</p>
</div>
</div>

<div id="outline-container-org402e646" class="outline-3">
<h3 id="org402e646"><span class="section-number-3">5.9</span> 强制调用基类虚函数</h3>
<div class="outline-text-3" id="text-5-9">
<div class="org-src-container">
<pre class="src src-cpp">p_base-&gt;<span style="color: #4e3163;">Base</span>::fn();<span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#20351;&#29992;&#20316;&#29992;&#22495;&#25351;&#23450;</span>
</pre>
</div>
</div>
</div>
