org/lang/cpp.org
*** auto
    #+BEGIN_SRC cpp
      auto x = 42; // case1
      const auto cx = x; // case1
      const auto &cx = x; // case3
      auto &&uref1 = x; // case4: uref1 -> int &
      auto &&uref2 = cx; // case4: uref2 -> const int &
      auto &&uref3 = 42; // case4: uref3 -> int &&

      const char name[] = "beep";
      auto arr1 = name; // arr1 -> const char *
      auto &arr2 = name; // arr2 -> const char (&)[]

      void somefn(int);
      auto func1 = somefn; // func1 -> void (*)(int)
      auto &func2 = somefn; // func2 -> void (&)(int)

      auto x = {27}; // notice: x -> std::initializer_list<int>
    #+END_SRC
    - *auto* 与模板类型推断唯一的不同在于 auto 会将{}包围的初始化列表，推断为 *std::initializer_list*
    - C++14 允许函数返回值使用 *auto* ，但这里 *auto* 的行为方式与模板类型推断一致；C++14 lambda 中
    的 *auto* 参数也是如此
*** decltype
    - *decltype* 通常不做任何修改的返回变量或表达式的类型，非常直观
    - 对容器中的下标操作 *operator[]* 使用 *decltype* 则返回 *T&*
    - *decltype* 常用于模板函数，通过函数的参数推断函数的返回值类型，并置于函数签名结尾
      #+BEGIN_SRC cpp
        template<typename Container, typename Index>
        auto Access(Container &c, Index i)
            -> decltype(c[i]) {
          return c[i];
        }
      #+END_SRC
      这里的 *auto* 没有任何推断作用，只是用于标识尾部的 *decltype* 。C++14 语法允许去掉尾部的 *decltype* 。
      #+BEGIN_SRC cpp
        std::vector<int> vec{1, 2, 3};
        Access(vec, 1) = 10; // Wrong，实际返回值为 int，且是一个 rvalue
      #+END_SRC

*** decltype(auto)
    *auto* 说明类型需要被推断， *decltype* 说明推断的时候应使用 *decltype* 的规则；C++14 only.
      #+BEGIN_SRC cpp
        int i = 42;
        const int &ci = i;
        auto a1 = ci; // a1 -> int
        decltype(auto) a2 = ci; // a2 -> const int &
        decltype((i)) a3 = i; // a3 -> int & 因为(i)为表达式且求值结果为左值，decltype 返回引用
        int *pi = 42;
        decltype(*pi) a4 = i; // a4 -> int & 同 a3，*pi 为表达式
      #+END_SRC

*** perfect forwarding
    #+BEGIN_SRC cpp
      template <typename T> decltype(auto) f(T &&param) {
        return std::forward<T>(param);
      } // for C++14

      template <typename T> auto f(T &&param) -> decltype(std::forward<T>(param)) {
        return std::forward<T>(param);
      } // for C++11
    #+END_SRC

** 类型转换
*** 隐式转换
    #+BEGIN_SRC cpp
      int i = 5;
      double d = 3.14;
      int ival = d + i;
    #+END_SRC
    1. i: int -> double
    2. d + i -> 8.14
    3. 8.14 -> int
*** 显式转换
**** static_cast
     #+BEGIN_SRC cpp
       auto d = static_cast<double>(i);
       void *p;
       auto pd = static_cast<double*>(p);
     #+END_SRC
**** dynamic_cast
     多态指针转换，可通过返回值判断转换是否成功
**** const_cast
     去掉 const 修饰
     #+BEGIN_SRC cpp
       const char *pc;
       char *p = const_cast<char *>(pc)
     #+END_SRC
     常常用于函数重载的情况
**** reinterpret_cast
     用来处理无关类型之间的转换，字面意思“重新解释（类型的比特位）”，不安全避免使用。
** 运行时类型识别 typeid
- typeid 用于指针类型，始终返回该指针静态编译时的类型
- typeid 作用于在继承体系中的类时，是否返回静态编译时类型取决于类是否包含虚函数

* 容器
