cpp/cpp.html
<div id="outline-container-org6447e2e" class="outline-4">
<h4 id="org6447e2e">auto</h4>
<div class="outline-text-4" id="text-org6447e2e">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">x</span> = 42; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">case1</span>
<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #3a81c3; font-weight: bold;">auto</span> cx = x; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">case1</span>
<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #3a81c3; font-weight: bold;">auto</span> &amp;<span style="color: #715ab1;">cx</span> = x; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">case3</span>
<span style="color: #3a81c3; font-weight: bold;">auto</span> &amp;&amp;<span style="color: #715ab1;">uref1</span> = x; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">case4: uref1 -&gt; int &amp;</span>
<span style="color: #3a81c3; font-weight: bold;">auto</span> &amp;&amp;<span style="color: #715ab1;">uref2</span> = cx; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">case4: uref2 -&gt; const int &amp;</span>
<span style="color: #3a81c3; font-weight: bold;">auto</span> &amp;&amp;<span style="color: #715ab1;">uref3</span> = 42; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">case4: uref3 -&gt; int &amp;&amp;</span>

<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">char</span> <span style="color: #715ab1;">name</span>[] = <span style="color: #2d9574;">"beep"</span>;
<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">arr1</span> = name; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">arr1 -&gt; const char *</span>
<span style="color: #3a81c3; font-weight: bold;">auto</span> &amp;<span style="color: #715ab1;">arr2</span> = name; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">arr2 -&gt; const char (&amp;)[]</span>

<span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">somefn</span>(<span style="color: #ba2f59; font-weight: bold;">int</span>);
<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">func1</span> = somefn; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">func1 -&gt; void (*)(int)</span>
<span style="color: #3a81c3; font-weight: bold;">auto</span> &amp;<span style="color: #715ab1;">func2</span> = somefn; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">func2 -&gt; void (&amp;)(int)</span>

<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">x</span> = {27}; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">notice: x -&gt; std::initializer_list&lt;int&gt;</span>
</pre>
</div>
<ul class="org-ul">
<li><b>auto</b> 与模板类型推断唯一的不同在于 auto 会将{}包围的初始化列表，推断为 <b>std::initializer_list</b></li>
<li>C++14 允许函数返回值使用 <b>auto</b> ，但这里 <b>auto</b> 的行为方式与模板类型推断一致；C++14 lambda 中</li>
</ul>
<p>
的 <b>auto</b> 参数也是如此
</p>
</div>
</div>
<div id="outline-container-org8619d1f" class="outline-4">
<h4 id="org8619d1f">decltype</h4>
<div class="outline-text-4" id="text-org8619d1f">
<ul class="org-ul">
<li><b>decltype</b> 通常不做任何修改的返回变量或表达式的类型，非常直观</li>
<li>对容器中的下标操作 <b>operator[]</b> 使用 <b>decltype</b> 则返回 <b>T&amp;</b></li>
<li><p>
<b>decltype</b> 常用于模板函数，通过函数的参数推断函数的返回值类型，并置于函数签名结尾
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">template</span>&lt;<span style="color: #3a81c3; font-weight: bold;">typename</span> <span style="color: #ba2f59; font-weight: bold;">Container</span>, <span style="color: #3a81c3; font-weight: bold;">typename</span> <span style="color: #ba2f59; font-weight: bold;">Index</span>&gt;
<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #6c3163; font-weight: bold;">Access</span>(<span style="color: #ba2f59; font-weight: bold;">Container</span> &amp;<span style="color: #715ab1;">c</span>, <span style="color: #ba2f59; font-weight: bold;">Index</span> <span style="color: #715ab1;">i</span>)
    -&gt; <span style="color: #3a81c3; font-weight: bold;">decltype</span>(c[i]) {
  <span style="color: #3a81c3; font-weight: bold;">return</span> c[i];
}
</pre>
</div>
<p>
这里的 <b>auto</b> 没有任何推断作用，只是用于标识尾部的 <b>decltype</b> 。C++14 语法允许去掉尾部的 <b>decltype</b> 。
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">vector</span>&lt;<span style="color: #ba2f59; font-weight: bold;">int</span>&gt; <span style="color: #715ab1;">vec</span>{1, 2, 3};
Access(vec, 1) = 10; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Wrong&#65292;&#23454;&#38469;&#36820;&#22238;&#20540;&#20026; int&#65292;&#19988;&#26159;&#19968;&#20010; rvalue</span>
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgc078d29" class="outline-4">
<h4 id="orgc078d29">decltype(auto)</h4>
<div class="outline-text-4" id="text-orgc078d29">
<p>
<b>auto</b> 说明类型需要被推断， <b>decltype</b> 说明推断的时候应使用 <b>decltype</b> 的规则；C++14 only.
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">i</span> = 42;
<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">int</span> &amp;<span style="color: #715ab1;">ci</span> = i;
<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">a1</span> = ci; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">a1 -&gt; int</span>
<span style="color: #3a81c3; font-weight: bold;">decltype</span>(<span style="color: #3a81c3; font-weight: bold;">auto</span>) <span style="color: #715ab1;">a2</span> = ci; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">a2 -&gt; const int &amp;</span>
<span style="color: #3a81c3; font-weight: bold;">decltype</span>((i)) <span style="color: #715ab1;">a3</span> = i; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">a3 -&gt; int &amp; &#22240;&#20026;(i)&#20026;&#34920;&#36798;&#24335;&#19988;&#27714;&#20540;&#32467;&#26524;&#20026;&#24038;&#20540;&#65292;decltype &#36820;&#22238;&#24341;&#29992;</span>
<span style="color: #ba2f59; font-weight: bold;">int</span> *<span style="color: #715ab1;">pi</span> = 42;
<span style="color: #3a81c3; font-weight: bold;">decltype</span>(*pi) <span style="color: #715ab1;">a4</span> = i; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">a4 -&gt; int &amp; &#21516; a3&#65292;*pi &#20026;&#34920;&#36798;&#24335;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org70c9872" class="outline-4">
<h4 id="org70c9872">perfect forwarding</h4>
<div class="outline-text-4" id="text-org70c9872">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">template</span> &lt;<span style="color: #3a81c3; font-weight: bold;">typename</span> <span style="color: #ba2f59; font-weight: bold;">T</span>&gt; <span style="color: #3a81c3; font-weight: bold;">decltype</span>(<span style="color: #3a81c3; font-weight: bold;">auto</span>) <span style="color: #6c3163; font-weight: bold;">f</span>(<span style="color: #ba2f59; font-weight: bold;">T</span> &amp;&amp;<span style="color: #715ab1;">param</span>) {
  <span style="color: #3a81c3; font-weight: bold;">return</span> <span style="color: #4e3163;">std</span>::forward&lt;<span style="color: #ba2f59; font-weight: bold;">T</span>&gt;(param);
} <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">for C++14</span>

<span style="color: #3a81c3; font-weight: bold;">template</span> &lt;<span style="color: #3a81c3; font-weight: bold;">typename</span> <span style="color: #ba2f59; font-weight: bold;">T</span>&gt; <span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #6c3163; font-weight: bold;">f</span>(<span style="color: #ba2f59; font-weight: bold;">T</span> &amp;&amp;<span style="color: #715ab1;">param</span>) -&gt; <span style="color: #3a81c3; font-weight: bold;">decltype</span>(<span style="color: #4e3163;">std</span>::forward&lt;<span style="color: #ba2f59; font-weight: bold;">T</span>&gt;(param)) {
  <span style="color: #3a81c3; font-weight: bold;">return</span> <span style="color: #4e3163;">std</span>::forward&lt;<span style="color: #ba2f59; font-weight: bold;">T</span>&gt;(param);
} <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">for C++11</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfb55d0f" class="outline-3">
<h3 id="orgfb55d0f"><span class="section-number-3">6.3</span> 类型转换</h3>
<div class="outline-text-3" id="text-6-3">
</div>
<div id="outline-container-orgaecbb98" class="outline-4">
<h4 id="orgaecbb98">隐式转换</h4>
<div class="outline-text-4" id="text-orgaecbb98">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">i</span> = 5;
<span style="color: #ba2f59; font-weight: bold;">double</span> <span style="color: #715ab1;">d</span> = 3.14;
<span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">ival</span> = d + i;
</pre>
</div>
<ol class="org-ol">
<li>i: int -&gt; double</li>
<li>d + i -&gt; 8.14</li>
<li>8.14 -&gt; int</li>
</ol>
</div>
</div>
<div id="outline-container-org35d64c8" class="outline-4">
<h4 id="org35d64c8">显式转换</h4>
<div class="outline-text-4" id="text-org35d64c8">
</div>
<ul class="org-ul">
<li><a id="org8bfbdb1"></a>static_cast<br />
<div class="outline-text-5" id="text-org8bfbdb1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">d</span> = <span style="color: #3a81c3; font-weight: bold;">static_cast</span>&lt;<span style="color: #ba2f59; font-weight: bold;">double</span>&gt;(i);
<span style="color: #ba2f59; font-weight: bold;">void</span> *<span style="color: #715ab1;">p</span>;
<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">pd</span> = <span style="color: #3a81c3; font-weight: bold;">static_cast</span>&lt;<span style="color: #ba2f59; font-weight: bold;">double</span>*&gt;(p);
</pre>
</div>
</div>
</li>
<li><a id="org06f441f"></a>dynamic_cast<br />
<div class="outline-text-5" id="text-org06f441f">
<p>
多态指针转换，可通过返回值判断转换是否成功
</p>
</div>
</li>
<li><a id="org4e71f3c"></a>const_cast<br />
<div class="outline-text-5" id="text-org4e71f3c">
<p>
去掉 const 修饰
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">char</span> *<span style="color: #715ab1;">pc</span>;
<span style="color: #ba2f59; font-weight: bold;">char</span> *<span style="color: #715ab1;">p</span> = <span style="color: #3a81c3; font-weight: bold;">const_cast</span>&lt;<span style="color: #ba2f59; font-weight: bold;">char</span> *&gt;(pc)
</pre>
</div>
<p>
常常用于函数重载的情况
</p>
</div>
</li>
<li><a id="orgf12ba5e"></a>reinterpret_cast<br />
<div class="outline-text-5" id="text-orgf12ba5e">
<p>
用来处理无关类型之间的转换，字面意思“重新解释（类型的比特位）”，不安全避免使用。
</p>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org480f723" class="outline-3">
<h3 id="org480f723"><span class="section-number-3">6.4</span> 运行时类型识别 typeid</h3>
<div class="outline-text-3" id="text-6-4">
<ul class="org-ul">
<li>typeid 用于指针类型，始终返回该指针静态编译时的类型</li>
<li>typeid 作用于在继承体系中的类时，是否返回静态编译时类型取决于类是否包含虚函数</li>
</ul>
</div>
</div>
</div>
