org/lang/cpp.org
** 数组
   - 声明
     #+BEGIN_SRC cpp
       int *ptrs[10]; //指针数组，指针都指向一个 int 对象
       int &refs[10]; //语法错误：不存在引用的数组
       int (*pArray)[10]; //指向一个 int 数组
       int (&rArray)[10]; //引用一个 int 数组

       using int_array = int[10];
       int_array *pArray; //指向一个 int 数组，更简洁
     #+END_SRC
   - 使用数组初始化 vector
     #+BEGIN_SRC cpp
       int array[] = {1,5,3,6,9};
       std::vector<int> vec(std::begin(array), std::end(array));
     #+END_SRC
   - 多维数组
     #+BEGIN_SRC cpp
       int array[2][3] = {2,5,7,5,3,1};
       for (auto &row: array)
         for (auto col: row)
             std::cout << col << std::endl;
     #+END_SRC
     - 2 行 3 列数组，使用 for range 时，外层循环要用引用，为了避免数组被自动转成指针

** iterator
   - C++11 引入 cbegin 和 cend，调用他们返回一个 const_iterator，支持只读访问。
   - C++11 引入全局函数 begin 和 end，定义在 iterator 头文件中。
     #+BEGIN_SRC cpp
       int test[] = {1,5,6,8,3,4};
       for (auto it = std::begin(test);
            it != std::end(test); it++) {
         std::cout << *it << std::endl;
       }
     #+END_SRC
   - 迭代器循环体内不能执行改变迭代器容量的操作，如执行会使迭代器失效。

** C 风格字符串
   常用方法 strlen, strcmp, strcat, strcpy
   - c_str

     string 对象成员方法，返回 const char*，指向其内部的内容。
     #+BEGIN_SRC cpp
       std::string s("hello world!");
       auto c = s.c_str();
       s = "hello"; // cout << c print 'hello'
     #+END_SRC
** 顺序容器
   - vector
   - list
   - forward_list
   - deque
   - array
   - string
** 关联容器
*** 有序容器
*** 无序容器
    #+BEGIN_SRC cpp
      std::unordered_map<std::string, int> h{{"a", 2}, {"b", 4}};
      std::cout << h.bucket_count() << "\n";     //桶个数
      std::cout << h.max_bucket_count() << "\n"; //最大桶个数
      std::cout << h.bucket_size(1) << "\n";     //第 1 个桶内的元素个数
      std::cout << h.load_factor() << "\n";      //每个桶的平均元素数量
      std::cout << h.max_load_factor() << "\n"; //试图维护的每个桶的平均元素数量
      h.rehash(20); //桶个数设为大于等于 n，且桶个数>size/max_load_factor
      h.reserve(50);//使得 h 可以保存 n 个元素且不必 rehash
    #+END_SRC

** 遍历删元素
   #+BEGIN_SRC cpp
     std::vector<int> ivec{7, 2, 6, 5, 5, 6, 1};
     std::cout << ivec.capacity() << "\n";
     for (auto it = ivec.begin(); it != ivec.end();) {
       if (*it == 6) {
         it = ivec.erase(it);
       } else {
         ++it;
       }
     }
   #+END_SRC
** 容器适配器
   - stack(默认基于 deque)
   - queue(默认基于 deque)
   - priority_queue(默认基于 vector)
** 常用泛型算法
*** 算法形式
    - alg(beg, end, /other args/);
    - alg(beg, end, dest, /other args/);
    - alg(beg, end, beg2, /other args/);
    - alg(beg, end, beg2, end2, /other args/);

*** 读
    find, accumlate, equal, all, any, none, for_each, count, mismatch, search

*** 写
    fill, copy, move, replace, generate, remove, unique, reverse, rotate, shuffle
    - XXX_copy 会讲结果额外拷贝到新的集合中，即 non-inplace

*** 容器自定的算法通常性能更好
    如 list, forward_list 的 sort, merge, remove, reverse 和 unique

** 非常规迭代器
*** insert iterator
**** back_inserter
     #+BEGIN_SRC cpp
       vector<int> vec;
       auto it = back_inserter(vec);
       *it = 42; //类似于 push_back(42)
     #+END_SRC
     常用于泛型算法的输出迭代器
**** front_inserter
     类似于 push_front
**** inserter
     指定插入位置的迭代器
*** stream iterator
