cpp/cpp.html

<div id="outline-container-orgc198792" class="outline-2">
<h2 id="orgc198792"><span class="section-number-2">7</span> 容器</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgdf2097a" class="outline-3">
<h3 id="orgdf2097a"><span class="section-number-3">7.1</span> 数组</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li><p>
声明
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">int</span> *<span style="color: #715ab1;">ptrs</span>[10]; <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#25351;&#38024;&#25968;&#32452;&#65292;&#25351;&#38024;&#37117;&#25351;&#21521;&#19968;&#20010; int &#23545;&#35937;</span>
<span style="color: #ba2f59; font-weight: bold;">int</span> &amp;<span style="color: #715ab1;">refs</span>[10]; <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#35821;&#27861;&#38169;&#35823;&#65306;&#19981;&#23384;&#22312;&#24341;&#29992;&#30340;&#25968;&#32452;</span>
<span style="color: #ba2f59; font-weight: bold;">int</span> (*<span style="color: #715ab1;">pArray</span>)[10]; <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#25351;&#21521;&#19968;&#20010; int &#25968;&#32452;</span>
<span style="color: #ba2f59; font-weight: bold;">int</span> (&amp;<span style="color: #715ab1;">rArray</span>)[10]; <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#24341;&#29992;&#19968;&#20010; int &#25968;&#32452;</span>

<span style="color: #3a81c3; font-weight: bold;">using</span> <span style="color: #ba2f59; font-weight: bold;">int_array</span> = <span style="color: #ba2f59; font-weight: bold;">int</span>[10];
<span style="color: #ba2f59; font-weight: bold;">int_array</span> *<span style="color: #715ab1;">pArray</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#25351;&#21521;&#19968;&#20010; int &#25968;&#32452;&#65292;&#26356;&#31616;&#27905;</span>
</pre>
</div></li>
<li><p>
使用数组初始化 vector
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">array</span>[] = {1,5,3,6,9};
<span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">vector</span>&lt;<span style="color: #ba2f59; font-weight: bold;">int</span>&gt; <span style="color: #6c3163; font-weight: bold;">vec</span>(<span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">begin</span>(<span style="color: #715ab1;">array</span>), <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">end</span>(<span style="color: #715ab1;">array</span>));
</pre>
</div></li>
<li><p>
多维数组
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">array</span>[2][3] = {2,5,7,5,3,1};
<span style="color: #3a81c3; font-weight: bold;">for</span> (<span style="color: #3a81c3; font-weight: bold;">auto</span> &amp;<span style="color: #715ab1;">row</span>: array)
  <span style="color: #3a81c3; font-weight: bold;">for</span> (<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">col</span>: row)
      <span style="color: #4e3163;">std</span>::cout &lt;&lt; col &lt;&lt; <span style="color: #4e3163;">std</span>::endl;
</pre>
</div>
<ul class="org-ul">
<li>2 行 3 列数组，使用 for range 时，外层循环要用引用，为了避免数组被自动转成指针</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgfe1e636" class="outline-3">
<h3 id="orgfe1e636"><span class="section-number-3">7.2</span> iterator</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>C++11 引入 cbegin 和 cend，调用他们返回一个 const_iterator，支持只读访问。</li>
<li><p>
C++11 引入全局函数 begin 和 end，定义在 iterator 头文件中。
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">test</span>[] = {1,5,6,8,3,4};
<span style="color: #3a81c3; font-weight: bold;">for</span> (<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">it</span> = <span style="color: #4e3163;">std</span>::begin(test);
     it != <span style="color: #4e3163;">std</span>::end(test); it++) {
  <span style="color: #4e3163;">std</span>::cout &lt;&lt; *it &lt;&lt; <span style="color: #4e3163;">std</span>::endl;
}
</pre>
</div></li>
<li>迭代器循环体内不能执行改变迭代器容量的操作，如执行会使迭代器失效。</li>
</ul>
</div>
</div>

<div id="outline-container-org7e1b5c3" class="outline-3">
<h3 id="org7e1b5c3"><span class="section-number-3">7.3</span> C 风格字符串</h3>
<div class="outline-text-3" id="text-7-3">
<p>
常用方法 strlen, strcmp, strcat, strcpy
</p>
<ul class="org-ul">
<li><p>
c_str
</p>

<p>
string 对象成员方法，返回 const char*，指向其内部的内容。
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">string</span> <span style="color: #715ab1;">s</span>(<span style="color: #2d9574;">"hello world!"</span>);
<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">c</span> = s.c_str();
s = <span style="color: #2d9574;">"hello"</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">cout &lt;&lt; c print 'hello'</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgb33ada5" class="outline-3">
<h3 id="orgb33ada5"><span class="section-number-3">7.4</span> 顺序容器</h3>
<div class="outline-text-3" id="text-7-4">
<ul class="org-ul">
<li>vector</li>
<li>list</li>
<li>forward_list</li>
<li>deque</li>
<li>array</li>
<li>string</li>
</ul>
</div>
</div>
<div id="outline-container-orgf97db91" class="outline-3">
<h3 id="orgf97db91"><span class="section-number-3">7.5</span> 关联容器</h3>
<div class="outline-text-3" id="text-7-5">
</div>
<div id="outline-container-orge47257c" class="outline-4">
<h4 id="orge47257c">有序容器</h4>
</div>
<div id="outline-container-org8f180b4" class="outline-4">
<h4 id="org8f180b4">无序容器</h4>
<div class="outline-text-4" id="text-org8f180b4">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">unordered_map</span>&lt;<span style="color: #4e3163;">std</span>::string, <span style="color: #ba2f59; font-weight: bold;">int</span>&gt; <span style="color: #715ab1;">h</span>{{<span style="color: #2d9574;">"a"</span>, 2}, {<span style="color: #2d9574;">"b"</span>, 4}};
<span style="color: #4e3163;">std</span>::cout &lt;&lt; h.bucket_count() &lt;&lt; <span style="color: #2d9574;">"\n"</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26742;&#20010;&#25968;</span>
<span style="color: #4e3163;">std</span>::cout &lt;&lt; h.max_bucket_count() &lt;&lt; <span style="color: #2d9574;">"\n"</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26368;&#22823;&#26742;&#20010;&#25968;</span>
<span style="color: #4e3163;">std</span>::cout &lt;&lt; h.bucket_size(1) &lt;&lt; <span style="color: #2d9574;">"\n"</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#31532; 1 &#20010;&#26742;&#20869;&#30340;&#20803;&#32032;&#20010;&#25968;</span>
<span style="color: #4e3163;">std</span>::cout &lt;&lt; h.load_factor() &lt;&lt; <span style="color: #2d9574;">"\n"</span>;      <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#27599;&#20010;&#26742;&#30340;&#24179;&#22343;&#20803;&#32032;&#25968;&#37327;</span>
<span style="color: #4e3163;">std</span>::cout &lt;&lt; h.max_load_factor() &lt;&lt; <span style="color: #2d9574;">"\n"</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#35797;&#22270;&#32500;&#25252;&#30340;&#27599;&#20010;&#26742;&#30340;&#24179;&#22343;&#20803;&#32032;&#25968;&#37327;</span>
h.rehash(20); <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26742;&#20010;&#25968;&#35774;&#20026;&#22823;&#20110;&#31561;&#20110; n&#65292;&#19988;&#26742;&#20010;&#25968;&gt;size/max_load_factor</span>
h.reserve(50);<span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#20351;&#24471; h &#21487;&#20197;&#20445;&#23384; n &#20010;&#20803;&#32032;&#19988;&#19981;&#24517; rehash</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org22739f0" class="outline-3">
<h3 id="org22739f0"><span class="section-number-3">7.6</span> 遍历删元素</h3>
<div class="outline-text-3" id="text-7-6">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">vector</span>&lt;<span style="color: #ba2f59; font-weight: bold;">int</span>&gt; <span style="color: #715ab1;">ivec</span>{7, 2, 6, 5, 5, 6, 1};
<span style="color: #4e3163;">std</span>::cout &lt;&lt; ivec.capacity() &lt;&lt; <span style="color: #2d9574;">"\n"</span>;
<span style="color: #3a81c3; font-weight: bold;">for</span> (<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">it</span> = ivec.begin(); it != ivec.end();) {
  <span style="color: #3a81c3; font-weight: bold;">if</span> (*it == 6) {
    it = ivec.erase(it);
  } <span style="color: #3a81c3; font-weight: bold;">else</span> {
    ++it;
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org3ca742c" class="outline-3">
<h3 id="org3ca742c"><span class="section-number-3">7.7</span> 容器适配器</h3>
<div class="outline-text-3" id="text-7-7">
<ul class="org-ul">
<li>stack(默认基于 deque)</li>
<li>queue(默认基于 deque)</li>
<li>priority_queue(默认基于 vector)</li>
</ul>
</div>
</div>
<div id="outline-container-org314454b" class="outline-3">
<h3 id="org314454b"><span class="section-number-3">7.8</span> 常用泛型算法</h3>
<div class="outline-text-3" id="text-7-8">
</div>
<div id="outline-container-orga9b7dec" class="outline-4">
<h4 id="orga9b7dec">算法形式</h4>
<div class="outline-text-4" id="text-orga9b7dec">
<ul class="org-ul">
<li>alg(beg, end, <i>other args</i>);</li>
<li>alg(beg, end, dest, <i>other args</i>);</li>
<li>alg(beg, end, beg2, <i>other args</i>);</li>
<li>alg(beg, end, beg2, end2, <i>other args</i>);</li>
</ul>
</div>
</div>

<div id="outline-container-orgc6e3541" class="outline-4">
<h4 id="orgc6e3541">读</h4>
<div class="outline-text-4" id="text-orgc6e3541">
<p>
find, accumlate, equal, all, any, none, for_each, count, mismatch, search
</p>
</div>
</div>

<div id="outline-container-orgad4b435" class="outline-4">
<h4 id="orgad4b435">写</h4>
<div class="outline-text-4" id="text-orgad4b435">
<p>
fill, copy, move, replace, generate, remove, unique, reverse, rotate, shuffle
</p>
<ul class="org-ul">
<li>XXX_copy 会讲结果额外拷贝到新的集合中，即 non-inplace</li>
</ul>
</div>
</div>

<div id="outline-container-orga4b9468" class="outline-4">
<h4 id="orga4b9468">容器自定的算法通常性能更好</h4>
<div class="outline-text-4" id="text-orga4b9468">
<p>
如 list, forward_list 的 sort, merge, remove, reverse 和 unique
</p>
</div>
</div>
</div>

<div id="outline-container-org5762fb3" class="outline-3">
<h3 id="org5762fb3"><span class="section-number-3">7.9</span> 非常规迭代器</h3>
<div class="outline-text-3" id="text-7-9">
</div>
<div id="outline-container-orgdf7de60" class="outline-4">
<h4 id="orgdf7de60">insert iterator</h4>
<div class="outline-text-4" id="text-orgdf7de60">
</div>
<ul class="org-ul">
<li><a id="orga4c8a5a"></a>back_inserter<br />
<div class="outline-text-5" id="text-orga4c8a5a">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">vector</span>&lt;<span style="color: #ba2f59; font-weight: bold;">int</span>&gt; <span style="color: #715ab1;">vec</span>;
<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">it</span> = back_inserter(vec);
*it = 42; <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#31867;&#20284;&#20110; push_back(42)</span>
</pre>
</div>
<p>
常用于泛型算法的输出迭代器
</p>
</div>
</li>
