org/lang/cpp.org
**** istream_iterator
     #+BEGIN_SRC cpp
       std::istream_iterator<int> ist(cin), eof; //默认构造创建一个 eof 值
       vector<int> vec;
       std::transform(ist, eof, std::back_inserter(vec),
                      [](auto a) { return a * 2; });
     #+END_SRC
**** ostream_iterator
     #+BEGIN_SRC cpp
       vector<int> vec{9, 5, 5, 3, 5, 7, 8, 2};
       std::ostream_iterator<int> ost(cout);
       std::transform(vec.begin(), vec.end(), ost, [](auto a) { return a * 2; });
     #+END_SRC
*** reverse iterator
    rbegin, rend
*** move iterator

*** local_iterator
    无序容器的桶(bucket)迭代器
* 智能指针
** 动态数组
*** unique_ptr
    #+BEGIN_SRC cpp
      {
        std::unique_ptr<int[]> array(new int[10]);
      } // 超出作用域自动调用 delete []释放
    #+END_SRC
*** shared_ptr
    默认不支持 delete[]释放，需自定义删除器
    #+BEGIN_SRC cpp
      {
        std::shared_ptr<int[]> array(new int[10], [](int *p) { delete[] p; });
      }
    #+END_SRC
** allocator 类
   用于分离 *内存分配* 和 *对象构造*
*** 内存分配
    - allocate
    - deallocate
*** 对象构造与析构
    - construct
    - destroy
*** 未初始化内存的拷贝
    - uninitialized_copy
    - uninitialized_fill
* 移动语义
** std::move & std::forward
   - *std::move* 实际只做右值转换，不做任何 move 的事情
   - *std::forward* 当参数是通过右值初始化时， *std::forward* 将其转化成右值，若为左值则返回原参数类型。
     #+BEGIN_SRC cpp
       void process(const int &n);
       void process(int &&n);

       template<typename T>
       void forward_test(T &&param) {
         process(std::forward<T>(param));//因 param 本身是一个左值，可以通过 std::forward 进行转换
       }

       int a = 0;
       forward_test(a); //lvalue->process
       forward_test(std::move(a)); // rvalue->process, n in process initialized by rvalue
     #+END_SRC
     即当用于 universal reference 时，forward 会保持实参类型的所有细节，可以实现完美转发。

** universal reference
   当"T&&"引用遇上类型推断时，则为 universal 引用；其余时候为右值引用
   #+BEGIN_SRC cpp
     template<typename T>
     void f(T &&param); // param is universal reference

     int &&var1 = 1;
     auto &&var2 = var1; // var2 is universal reference
   #+END_SRC

* lambda
** C++14 lambda hints
   #+BEGIN_SRC cpp
     auto func = [data = std::move(data)] {...}; // C++14 init capture
     auto func = [](auto &&x) { return normalize(std::forward<decltype(x)>x); }; // C++14 forward lambda
   #+END_SRC
