cpp/cpp.html
<li><a id="org151da74"></a>front_inserter<br />
<div class="outline-text-5" id="text-org151da74">
<p>
类似于 push_front
</p>
</div>
</li>
<li><a id="org649c066"></a>inserter<br />
<div class="outline-text-5" id="text-org649c066">
<p>
指定插入位置的迭代器
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org33feb68" class="outline-4">
<h4 id="org33feb68">stream iterator</h4>
<div class="outline-text-4" id="text-org33feb68">
</div>
<ul class="org-ul">
<li><a id="org1d3f312"></a>istream_iterator<br />
<div class="outline-text-5" id="text-org1d3f312">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">istream_iterator</span>&lt;<span style="color: #ba2f59; font-weight: bold;">int</span>&gt; <span style="color: #6c3163; font-weight: bold;">ist</span>(cin), <span style="color: #715ab1;">eof</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#40664;&#35748;&#26500;&#36896;&#21019;&#24314;&#19968;&#20010; eof &#20540;</span>
<span style="color: #ba2f59; font-weight: bold;">vector</span>&lt;<span style="color: #ba2f59; font-weight: bold;">int</span>&gt; <span style="color: #715ab1;">vec</span>;
<span style="color: #4e3163;">std</span>::transform(ist, eof, <span style="color: #4e3163;">std</span>::back_inserter(vec),
               [](<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">a</span>) { <span style="color: #3a81c3; font-weight: bold;">return</span> a * 2; });
</pre>
</div>
</div>
</li>
<li><a id="org3059011"></a>ostream_iterator<br />
<div class="outline-text-5" id="text-org3059011">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">vector</span>&lt;<span style="color: #ba2f59; font-weight: bold;">int</span>&gt; <span style="color: #715ab1;">vec</span>{9, 5, 5, 3, 5, 7, 8, 2};
<span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">ostream_iterator</span>&lt;<span style="color: #ba2f59; font-weight: bold;">int</span>&gt; <span style="color: #6c3163; font-weight: bold;">ost</span>(cout);
<span style="color: #4e3163;">std</span>::transform(vec.begin(), vec.end(), ost, [](<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">a</span>) { <span style="color: #3a81c3; font-weight: bold;">return</span> a * 2; });
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org2fbf15f" class="outline-4">
<h4 id="org2fbf15f">reverse iterator</h4>
<div class="outline-text-4" id="text-org2fbf15f">
<p>
rbegin, rend
</p>
</div>
</div>
<div id="outline-container-org6c27f7e" class="outline-4">
<h4 id="org6c27f7e">move iterator</h4>
</div>

<div id="outline-container-org38ff4eb" class="outline-4">
<h4 id="org38ff4eb">local_iterator</h4>
<div class="outline-text-4" id="text-org38ff4eb">
<p>
无序容器的桶(bucket)迭代器
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org02bc99d" class="outline-2">
<h2 id="org02bc99d"><span class="section-number-2">8</span> 智能指针</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org603a87f" class="outline-3">
<h3 id="org603a87f"><span class="section-number-3">8.1</span> 动态数组</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org183835b" class="outline-4">
<h4 id="org183835b">unique_ptr</h4>
<div class="outline-text-4" id="text-org183835b">
<div class="org-src-container">
<pre class="src src-cpp">{
  <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">unique_ptr</span>&lt;<span style="color: #ba2f59; font-weight: bold;">int</span>[]&gt; <span style="color: #715ab1;">array</span>(<span style="color: #3a81c3; font-weight: bold;">new</span> <span style="color: #ba2f59; font-weight: bold;">int</span>[10]);
} <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#36229;&#20986;&#20316;&#29992;&#22495;&#33258;&#21160;&#35843;&#29992; delete []&#37322;&#25918;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org33acc39" class="outline-4">
<h4 id="org33acc39">shared_ptr</h4>
<div class="outline-text-4" id="text-org33acc39">
<p>
默认不支持 delete[]释放，需自定义删除器
</p>
<div class="org-src-container">
<pre class="src src-cpp">{
  <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">shared_ptr</span>&lt;<span style="color: #ba2f59; font-weight: bold;">int</span>[]&gt; <span style="color: #715ab1;">array</span>(<span style="color: #3a81c3; font-weight: bold;">new</span> <span style="color: #ba2f59; font-weight: bold;">int</span>[10], [](<span style="color: #ba2f59; font-weight: bold;">int</span> *<span style="color: #715ab1;">p</span>) { <span style="color: #3a81c3; font-weight: bold;">delete</span>[] p; });
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org15f9b22" class="outline-3">
<h3 id="org15f9b22"><span class="section-number-3">8.2</span> allocator 类</h3>
<div class="outline-text-3" id="text-8-2">
<p>
用于分离 <b>内存分配</b> 和 <b>对象构造</b>
</p>
</div>
<div id="outline-container-orge920362" class="outline-4">
<h4 id="orge920362">内存分配</h4>
<div class="outline-text-4" id="text-orge920362">
<ul class="org-ul">
<li>allocate</li>
<li>deallocate</li>
</ul>
</div>
</div>
<div id="outline-container-org776669f" class="outline-4">
<h4 id="org776669f">对象构造与析构</h4>
<div class="outline-text-4" id="text-org776669f">
<ul class="org-ul">
<li>construct</li>
<li>destroy</li>
</ul>
</div>
</div>
<div id="outline-container-orge086db8" class="outline-4">
<h4 id="orge086db8">未初始化内存的拷贝</h4>
<div class="outline-text-4" id="text-orge086db8">
<ul class="org-ul">
<li>uninitialized_copy</li>
<li>uninitialized_fill</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbd7180f" class="outline-2">
<h2 id="orgbd7180f"><span class="section-number-2">9</span> 移动语义</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orge73fcdc" class="outline-3">
<h3 id="orge73fcdc"><span class="section-number-3">9.1</span> std::move &amp; std::forward</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li><b>std::move</b> 实际只做右值转换，不做任何 move 的事情</li>
<li><p>
<b>std::forward</b> 当参数是通过右值初始化时， <b>std::forward</b> 将其转化成右值，若为左值则返回原参数类型。
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">process</span>(<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">int</span> &amp;<span style="color: #715ab1;">n</span>);
<span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">process</span>(<span style="color: #ba2f59; font-weight: bold;">int</span> &amp;&amp;<span style="color: #715ab1;">n</span>);

<span style="color: #3a81c3; font-weight: bold;">template</span>&lt;<span style="color: #3a81c3; font-weight: bold;">typename</span> <span style="color: #ba2f59; font-weight: bold;">T</span>&gt;
<span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">forward_test</span>(<span style="color: #ba2f59; font-weight: bold;">T</span> &amp;&amp;<span style="color: #715ab1;">param</span>) {
  process(<span style="color: #4e3163;">std</span>::forward&lt;<span style="color: #ba2f59; font-weight: bold;">T</span>&gt;(param));<span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#22240; param &#26412;&#36523;&#26159;&#19968;&#20010;&#24038;&#20540;&#65292;&#21487;&#20197;&#36890;&#36807; std::forward &#36827;&#34892;&#36716;&#25442;</span>
}

<span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">a</span> = 0;
forward_test(a); <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">lvalue-&gt;process</span>
forward_test(<span style="color: #4e3163;">std</span>::move(a)); <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">rvalue-&gt;process, n in process initialized by rval</span><span style="color: #6c4173; background-color: #ecf3ec;">ue</span>
</pre>
</div>
<p>
即当用于 universal reference 时，forward 会保持实参类型的所有细节，可以实现完美转发。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orga6fde93" class="outline-3">
<h3 id="orga6fde93"><span class="section-number-3">9.2</span> universal reference</h3>
<div class="outline-text-3" id="text-9-2">
<p>
当"T&amp;&amp;"引用遇上类型推断时，则为 universal 引用；其余时候为右值引用
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">template</span>&lt;<span style="color: #3a81c3; font-weight: bold;">typename</span> <span style="color: #ba2f59; font-weight: bold;">T</span>&gt;
<span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">f</span>(<span style="color: #ba2f59; font-weight: bold;">T</span> &amp;&amp;<span style="color: #715ab1;">param</span>); <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">param is universal reference</span>

<span style="color: #ba2f59; font-weight: bold;">int</span> &amp;&amp;<span style="color: #715ab1;">var1</span> = 1;
<span style="color: #3a81c3; font-weight: bold;">auto</span> &amp;&amp;<span style="color: #715ab1;">var2</span> = var1; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">var2 is universal reference</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge131ade" class="outline-2">
<h2 id="orge131ade"><span class="section-number-2">10</span> lambda</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org1443b1d" class="outline-3">
<h3 id="org1443b1d"><span class="section-number-3">10.1</span> C++14 lambda hints</h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">func</span> = [<span style="color: #715ab1;">data</span> = <span style="color: #4e3163;">std</span>::move(data)] {...}; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">C++14 init capture</span>
<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">func</span> = [](<span style="color: #3a81c3; font-weight: bold;">auto</span> &amp;&amp;<span style="color: #715ab1;">x</span>) { <span style="color: #3a81c3; font-weight: bold;">return</span> normalize(<span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">forward</span>&lt;<span style="color: #3a81c3; font-weight: bold;">decltype</span>(x)&gt;<span style="color: #715ab1;">x</span>); }; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">C</span><span style="color: #6c4173; background-color: #ecf3ec;">++14 forward lambda</span>
</pre>
</div>
</div>
</div>
