org/lang/cpp.org
** mutable lambda
   #+BEGIN_SRC cpp
     int i = 42;
     auto func = [i]() mutable { return ++i; } // lambda 函数体内能改变 i 的值，默认按值传递不允许

     //类似生成如下类
     class Func {
      public:
       Func(int i) : i_(i) {}
       int operator()() {
         return ++i_;
       }

      private:
       int i_;
     };
   #+END_SRC
   如没有 mutable 修饰，则生成的 operator()会是 const 函数

* 模板
** 非类型参数模板
   #+BEGIN_SRC cpp
     template<int N, int M>
     bool less(const char (&p1)[N], const char (&p2)[M]); // 实例化时自动推断 N, M
   #+END_SRC
** 模板参数的静态成员
   默认情况 C++假定通过作用域运算符访问的名字是成员，非类型。可以使用 typename 显式的告诉编译器。
   #+BEGIN_SRC cpp
     T::size_type * p; //编译器并不知道是变量定义还是成员变量乘以 p
     typename T::size_type *p; //OK, 只能使用 typename，不能用 class
   #+END_SRC
** 显示实例化
   为了避免相同类型重复实例化，使用 extern 声明外部定义
   - *extern template* /declaration/: 声明
   - *template* /declaration/: 定义只能有一个
** 模板返回值
   #+BEGIN_SRC cpp
     template <typename It>
     auto fn(It begin, It end) -> typename remove_reference<decltype(*begin)>::type {
       return *begin
     }
   #+END_SRC
   - *begin 返回容器元素的引用
   - 使用 remove_reference 对类型去引用
   - 尾部 typename 显示告知编译器这里需要的是类型而非成员

** 标准类型转换模板
   remove_reference, add_const, add_lvalue_reference, add_rvalue_reference, remove_pointer,
   add_pointer, make_signed, make_unsigned, remove_extent, remove_all_extents

** 可变参数模板
   可不同类型多参数，使用 typename...来指定多个类型的列表，对于参数包，我们只能做两件事情
   - 获取参数包大小
   #+BEGIN_SRC cpp
     template<typename T, typename... Args>
     void foo(const T &t, const Args & ... args) {
       std::cout << sizeof...(Args) << "\n"; // 类型参数的数目
       std::cout << sizeof...(args) << "\n"; // 函数参数的数目
     }
   #+END_SRC
   - 扩展(expand)

      扩展的意思是将一个包分解为构成的元素
      #+BEGIN_SRC cpp
        template<typename T, typename... Args>
        void f(const T& t, const Args&... args) {
          while (sizeof...(args)) { //扩展生成函数参数列表
            std::cout << t << "\n";
            f(args...); //扩展生成实参列表
          }
        }

        template<typename T>
        void print(const T &t) {
          std::cout << t << "\n";
        }

        template<typename... Args>
        void f2(const Args&... args) {
          print(args)...; //对每一个 args 调用 print
        }
      #+END_SRC

