cpp/cpp.html
<div id="outline-container-orgc3039ce" class="outline-3">
<h3 id="orgc3039ce"><span class="section-number-3">10.2</span> mutable lambda</h3>
<div class="outline-text-3" id="text-10-2">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">i</span> = 42;
<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">func</span> = [<span style="color: #4e3163;">i</span>]() <span style="color: #3a81c3; font-weight: bold;">mutable</span> { <span style="color: #3a81c3; font-weight: bold;">return</span> ++i; } <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">lambda &#20989;&#25968;&#20307;&#20869;&#33021;&#25913;&#21464; i &#30340;&#20540;&#65292;&#40664;&#35748;&#25353;&#20540;&#20256;&#36882;&#19981;&#20801;&#35768;</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#31867;&#20284;&#29983;&#25104;&#22914;&#19979;&#31867;</span>
<span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">Func</span> {
 <span style="color: #3a81c3; font-weight: bold;">public</span>:
  <span style="color: #6c3163; font-weight: bold;">Func</span>(<span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">i</span>) : i_(i) {}
  <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #3a81c3; font-weight: bold;">operator</span><span style="color: #6c3163; font-weight: bold;">()</span>() {
    <span style="color: #3a81c3; font-weight: bold;">return</span> ++i_;
  }

 <span style="color: #3a81c3; font-weight: bold;">private</span>:
  <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">i_</span>;
};
</pre>
</div>
<p>
如没有 mutable 修饰，则生成的 operator()会是 const 函数
</p>
</div>
</div>
</div>

<div id="outline-container-org9b700d1" class="outline-2">
<h2 id="org9b700d1"><span class="section-number-2">11</span> 模板</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org3c71bb2" class="outline-3">
<h3 id="org3c71bb2"><span class="section-number-3">11.1</span> 非类型参数模板</h3>
<div class="outline-text-3" id="text-11-1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">template</span>&lt;<span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">N</span>, <span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">M</span>&gt;
<span style="color: #ba2f59; font-weight: bold;">bool</span> <span style="color: #6c3163; font-weight: bold;">less</span>(<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">char</span> (&amp;<span style="color: #715ab1;">p1</span>)[N], <span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">char</span> (&amp;<span style="color: #715ab1;">p2</span>)[M]); <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#23454;&#20363;&#21270;&#26102;&#33258;&#21160;&#25512;&#26029; N, M</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb4ec7f4" class="outline-3">
<h3 id="orgb4ec7f4"><span class="section-number-3">11.2</span> 模板参数的静态成员</h3>
<div class="outline-text-3" id="text-11-2">
<p>
默认情况 C++假定通过作用域运算符访问的名字是成员，非类型。可以使用 typename 显式的告诉编译器。
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4e3163;">T</span>::<span style="color: #ba2f59; font-weight: bold;">size_type</span> * <span style="color: #715ab1;">p</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#32534;&#35793;&#22120;&#24182;&#19981;&#30693;&#36947;&#26159;&#21464;&#37327;&#23450;&#20041;&#36824;&#26159;&#25104;&#21592;&#21464;&#37327;&#20056;&#20197; p</span>
<span style="color: #3a81c3; font-weight: bold;">typename</span> <span style="color: #4e3163;">T</span>::<span style="color: #ba2f59; font-weight: bold;">size_type</span> *<span style="color: #715ab1;">p</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">OK, &#21482;&#33021;&#20351;&#29992; typename&#65292;&#19981;&#33021;&#29992; class</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0f89c04" class="outline-3">
<h3 id="org0f89c04"><span class="section-number-3">11.3</span> 显示实例化</h3>
<div class="outline-text-3" id="text-11-3">
<p>
为了避免相同类型重复实例化，使用 extern 声明外部定义
</p>
<ul class="org-ul">
<li><b>extern template</b> <i>declaration</i>: 声明</li>
<li><b>template</b> <i>declaration</i>: 定义只能有一个</li>
</ul>
</div>
</div>
<div id="outline-container-org2139793" class="outline-3">
<h3 id="org2139793"><span class="section-number-3">11.4</span> 模板返回值</h3>
<div class="outline-text-3" id="text-11-4">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">template</span> &lt;<span style="color: #3a81c3; font-weight: bold;">typename</span> <span style="color: #ba2f59; font-weight: bold;">It</span>&gt;
<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #6c3163; font-weight: bold;">fn</span>(<span style="color: #ba2f59; font-weight: bold;">It</span> <span style="color: #715ab1;">begin</span>, <span style="color: #ba2f59; font-weight: bold;">It</span> <span style="color: #715ab1;">end</span>) -&gt; <span style="color: #3a81c3; font-weight: bold;">typename</span> <span style="color: #4e3163;">remove_reference</span>&lt;<span style="color: #3a81c3; font-weight: bold;">decltype</span>(*begin)&gt;::<span style="color: #ba2f59; font-weight: bold;">type</span> {
  <span style="color: #3a81c3; font-weight: bold;">return</span> *begin
}
</pre>
</div>
<ul class="org-ul">
<li>*begin 返回容器元素的引用</li>
<li>使用 remove_reference 对类型去引用</li>
<li>尾部 typename 显示告知编译器这里需要的是类型而非成员</li>
</ul>
</div>
</div>

<div id="outline-container-orge3b7600" class="outline-3">
<h3 id="orge3b7600"><span class="section-number-3">11.5</span> 标准类型转换模板</h3>
<div class="outline-text-3" id="text-11-5">
<p>
remove_reference, add_const, add_lvalue_reference, add_rvalue_reference, remove_pointer,
add_pointer, make_signed, make_unsigned, remove_extent, remove_all_extents
</p>
</div>
</div>

<div id="outline-container-org649fc86" class="outline-3">
<h3 id="org649fc86"><span class="section-number-3">11.6</span> 可变参数模板</h3>
<div class="outline-text-3" id="text-11-6">
<p>
可不同类型多参数，使用 typename&#x2026;来指定多个类型的列表，对于参数包，我们只能做两件事情
</p>
<ul class="org-ul">
<li>获取参数包大小</li>
</ul>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">template</span>&lt;<span style="color: #3a81c3; font-weight: bold;">typename</span> <span style="color: #ba2f59; font-weight: bold;">T</span>, <span style="color: #3a81c3; font-weight: bold;">typename</span>... <span style="color: #ba2f59; font-weight: bold;">Args</span>&gt;
<span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">foo</span>(<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">T</span> &amp;<span style="color: #715ab1;">t</span>, <span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">Args</span> &amp; ... <span style="color: #715ab1;">args</span>) {
  <span style="color: #4e3163;">std</span>::cout &lt;&lt; <span style="color: #3a81c3; font-weight: bold;">sizeof</span>...(Args) &lt;&lt; <span style="color: #2d9574;">"\n"</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#31867;&#22411;&#21442;&#25968;&#30340;&#25968;&#30446;</span>
  <span style="color: #4e3163;">std</span>::cout &lt;&lt; <span style="color: #3a81c3; font-weight: bold;">sizeof</span>...(args) &lt;&lt; <span style="color: #2d9574;">"\n"</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#20989;&#25968;&#21442;&#25968;&#30340;&#25968;&#30446;</span>
}
</pre>
</div>
<ul class="org-ul">
<li><p>
扩展(expand)
</p>

<p>
扩展的意思是将一个包分解为构成的元素
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">template</span>&lt;<span style="color: #3a81c3; font-weight: bold;">typename</span> <span style="color: #ba2f59; font-weight: bold;">T</span>, <span style="color: #3a81c3; font-weight: bold;">typename</span>... <span style="color: #ba2f59; font-weight: bold;">Args</span>&gt;
<span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">f</span>(<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">T</span>&amp; <span style="color: #715ab1;">t</span>, <span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">Args</span>&amp;... <span style="color: #715ab1;">args</span>) {
  <span style="color: #3a81c3; font-weight: bold;">while</span> (<span style="color: #3a81c3; font-weight: bold;">sizeof</span>...(args)) { <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#25193;&#23637;&#29983;&#25104;&#20989;&#25968;&#21442;&#25968;&#21015;&#34920;</span>
    <span style="color: #4e3163;">std</span>::cout &lt;&lt; t &lt;&lt; <span style="color: #2d9574;">"\n"</span>;
    f(args...); <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#25193;&#23637;&#29983;&#25104;&#23454;&#21442;&#21015;&#34920;</span>
  }
}

<span style="color: #3a81c3; font-weight: bold;">template</span>&lt;<span style="color: #3a81c3; font-weight: bold;">typename</span> <span style="color: #ba2f59; font-weight: bold;">T</span>&gt;
<span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">print</span>(<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">T</span> &amp;<span style="color: #715ab1;">t</span>) {
  <span style="color: #4e3163;">std</span>::cout &lt;&lt; t &lt;&lt; <span style="color: #2d9574;">"\n"</span>;
}

<span style="color: #3a81c3; font-weight: bold;">template</span>&lt;<span style="color: #3a81c3; font-weight: bold;">typename</span>... <span style="color: #ba2f59; font-weight: bold;">Args</span>&gt;
<span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">f2</span>(<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">Args</span>&amp;... <span style="color: #715ab1;">args</span>) {
  print(args)...; <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#23545;&#27599;&#19968;&#20010; args &#35843;&#29992; print</span>
}
</pre>
</div></li>
</ul>
</div>
