org/lang/cpp.org
*** 编写可变参数函数例子
    #+BEGIN_SRC cpp
      template<typename T>
      ostream &print(ostream &os, const T &t) {
        return os << t;
      }// 该函数用于对 rest 的最后一次调用终止递归

      template<typename T, typename... Args>
      ostream &print(ostream &os, const T &t, const Args&... rest) {
        os << t << ", ";
        return print(os, rest...) //递归，每次调用自己打印剩余 rest 中的第一个
      }
    #+END_SRC

*** emplace_back 的实现
    结合可变参数及 forward 机制实现 emplace_back
    #+BEGIN_SRC cpp
      template<typename... Args>
      void SomeVector::emplace_back(Args &&... args) {
        chk_n_alloc(); //如果需要重新分配 SomeVector 的内存空间
        alloc.construct(first_free++, std::forward<Args>(args)...);
      }
    #+END_SRC

** 模板特例化
   模板特例化指为原模板中的每个模板参数都提供实参，本质上接管了编译器的工作
   #+BEGIN_SRC cpp
     template<>
     int compare(const char* const &p1, const char* const &p2) {
       return strcmp(p1, p2);
     }
   #+END_SRC
   - 特例化本质是实例化一个模板，非重载；不影响函数匹配
*** 类模板可以部分特例化
    #+BEGIN_SRC cpp
      template <typename T> struct remove_reference { typedef T type; };

      template <typename T> struct remove_reference<T &> {
        typedef T type;
      }

      template <typename T>
      struct remove_reference<T &&> {
        typedef T type;
      }
    #+END_SRC

* 辅助调试
  - NDEBUG 宏
  - assert 宏
** 辅助变量
   #+BEGIN_EXAMPLE
   __func__, __FILE__, __LINE__, __TIME__, __DATE__
   #+END_EXAMPLE
* 输入输出流
** 缓冲区控制
   - endl: 输出一个换行符并刷新缓冲区
   - flush: 直接刷新缓冲区
   - ends: 输出一个'\0' 并刷新缓冲区
   - unitbuf: 设定输出流为每次写入直接刷新缓冲区
** tie 关联输出流
   例如标准输入流 cin 会关联标准输出流 cout，cin 会刷新 cout 的状态
   #+BEGIN_SRC cpp
     cin.tie(&cout);
   #+END_SRC
* string
** 例子：特定字符搜索
   #+BEGIN_SRC cpp
     string name = "r1b5";
     string numbers = "0123456789";
     string::size_type pos = 0;
     while ((pos = name.find_first_of(numbers, pos)) != string::npos) {
       std::cout << name[pos] << "\n";
       ++pos;
     }
   #+END_SRC
** 数值转换
   - std::to_string
   - stoXXX
* new & delete
  - 可重载 new 和 delete 操作符以控制 *内存分配*
  - 无法改变 *运算符* new 和 delete 的行为
    - 运算符 new 的操作：1) 调用 operator new 获取内存空间 2) 在内存空间中使用构造函数构造对象
    - 运算符 delete：1) 调用析构销毁对象 2) 调用 operator delete 回收内存空间
** placement new
    #+BEGIN_SRC cpp
      int *p = new (nothrow) int; // placement new, 不抛出异常，创建失败则返回 nullptr
    #+END_SRC
    也可以是如下形式：
    #+BEGIN_SRC cpp
      new (place_address) type
    #+END_SRC
    place_address 指定一个事先分配好内存的指针
    - placement new 类似于 allocator 的 construct 成员
** 标准库 allocator
   - allocate
   - deallocate
   - construct
   - destroy
* 异常
** 构造函数处理异常
   需要声明成函数 try 语句块，这样才能捕获构造函数的初始化过程
   #+BEGIN_SRC cpp
     Foo::Foo(int i) try : i_(i) {}
   #+END_SRC
* 标准库
** regex
