cpp/cpp.html

<div id="outline-container-orgf5f27e7" class="outline-4">
<h4 id="orgf5f27e7">编写可变参数函数例子</h4>
<div class="outline-text-4" id="text-orgf5f27e7">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">template</span>&lt;<span style="color: #3a81c3; font-weight: bold;">typename</span> <span style="color: #ba2f59; font-weight: bold;">T</span>&gt;
<span style="color: #ba2f59; font-weight: bold;">ostream</span> &amp;<span style="color: #6c3163; font-weight: bold;">print</span>(<span style="color: #ba2f59; font-weight: bold;">ostream</span> &amp;<span style="color: #715ab1;">os</span>, <span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">T</span> &amp;<span style="color: #715ab1;">t</span>) {
  <span style="color: #3a81c3; font-weight: bold;">return</span> os &lt;&lt; t;
}<span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#35813;&#20989;&#25968;&#29992;&#20110;&#23545; rest &#30340;&#26368;&#21518;&#19968;&#27425;&#35843;&#29992;&#32456;&#27490;&#36882;&#24402;</span>

<span style="color: #3a81c3; font-weight: bold;">template</span>&lt;<span style="color: #3a81c3; font-weight: bold;">typename</span> <span style="color: #ba2f59; font-weight: bold;">T</span>, <span style="color: #3a81c3; font-weight: bold;">typename</span>... <span style="color: #ba2f59; font-weight: bold;">Args</span>&gt;
<span style="color: #ba2f59; font-weight: bold;">ostream</span> &amp;<span style="color: #6c3163; font-weight: bold;">print</span>(<span style="color: #ba2f59; font-weight: bold;">ostream</span> &amp;<span style="color: #715ab1;">os</span>, <span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">T</span> &amp;<span style="color: #715ab1;">t</span>, <span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">Args</span>&amp;... <span style="color: #715ab1;">rest</span>) {
  os &lt;&lt; t &lt;&lt; <span style="color: #2d9574;">", "</span>;
  <span style="color: #3a81c3; font-weight: bold;">return</span> print(os, rest...) <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#36882;&#24402;&#65292;&#27599;&#27425;&#35843;&#29992;&#33258;&#24049;&#25171;&#21360;&#21097;&#20313; rest &#20013;&#30340;&#31532;&#19968;&#20010;</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e5f0e9" class="outline-4">
<h4 id="org5e5f0e9">emplace_back 的实现</h4>
<div class="outline-text-4" id="text-org5e5f0e9">
<p>
结合可变参数及 forward 机制实现 emplace_back
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">template</span>&lt;<span style="color: #3a81c3; font-weight: bold;">typename</span>... <span style="color: #ba2f59; font-weight: bold;">Args</span>&gt;
<span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #4e3163;">SomeVector</span>::<span style="color: #6c3163; font-weight: bold;">emplace_back</span>(<span style="color: #ba2f59; font-weight: bold;">Args</span> &amp;&amp;... <span style="color: #715ab1;">args</span>) {
  chk_n_alloc(); <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#22914;&#26524;&#38656;&#35201;&#37325;&#26032;&#20998;&#37197; SomeVector &#30340;&#20869;&#23384;&#31354;&#38388;</span>
  alloc.construct(first_free++, <span style="color: #4e3163;">std</span>::forward&lt;<span style="color: #ba2f59; font-weight: bold;">Args</span>&gt;(args)...);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0d94b8f" class="outline-3">
<h3 id="org0d94b8f"><span class="section-number-3">11.7</span> 模板特例化</h3>
<div class="outline-text-3" id="text-11-7">
<p>
模板特例化指为原模板中的每个模板参数都提供实参，本质上接管了编译器的工作
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">template</span>&lt;&gt;
<span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #6c3163; font-weight: bold;">compare</span>(<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">char</span>* <span style="color: #3a81c3; font-weight: bold;">const</span> &amp;<span style="color: #715ab1;">p1</span>, <span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">char</span>* <span style="color: #3a81c3; font-weight: bold;">const</span> &amp;<span style="color: #715ab1;">p2</span>) {
  <span style="color: #3a81c3; font-weight: bold;">return</span> strcmp(p1, p2);
}
</pre>
</div>
<ul class="org-ul">
<li>特例化本质是实例化一个模板，非重载；不影响函数匹配</li>
</ul>
</div>
<div id="outline-container-org2d5c317" class="outline-4">
<h4 id="org2d5c317">类模板可以部分特例化</h4>
<div class="outline-text-4" id="text-org2d5c317">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">template</span> &lt;<span style="color: #3a81c3; font-weight: bold;">typename</span> <span style="color: #ba2f59; font-weight: bold;">T</span>&gt; <span style="color: #3a81c3; font-weight: bold;">struct</span> <span style="color: #ba2f59; font-weight: bold;">remove_reference</span> { <span style="color: #3a81c3; font-weight: bold;">typedef</span> <span style="color: #ba2f59; font-weight: bold;">T</span> <span style="color: #ba2f59; font-weight: bold;">type</span>; };

<span style="color: #3a81c3; font-weight: bold;">template</span> &lt;<span style="color: #3a81c3; font-weight: bold;">typename</span> <span style="color: #ba2f59; font-weight: bold;">T</span>&gt; <span style="color: #3a81c3; font-weight: bold;">struct</span> <span style="color: #ba2f59; font-weight: bold;">remove_reference</span>&lt;<span style="color: #ba2f59; font-weight: bold;">T</span> &amp;&gt; {
  <span style="color: #3a81c3; font-weight: bold;">typedef</span> <span style="color: #ba2f59; font-weight: bold;">T</span> <span style="color: #ba2f59; font-weight: bold;">type</span>;
}

<span style="color: #3a81c3; font-weight: bold;">template</span> &lt;<span style="color: #3a81c3; font-weight: bold;">typename</span> <span style="color: #ba2f59; font-weight: bold;">T</span>&gt;
<span style="color: #3a81c3; font-weight: bold;">struct</span> <span style="color: #ba2f59; font-weight: bold;">remove_reference</span>&lt;<span style="color: #ba2f59; font-weight: bold;">T</span> &amp;&amp;&gt; {
  <span style="color: #3a81c3; font-weight: bold;">typedef</span> <span style="color: #ba2f59; font-weight: bold;">T</span> <span style="color: #ba2f59; font-weight: bold;">type</span>;
}
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org120e4c5" class="outline-2">
<h2 id="org120e4c5"><span class="section-number-2">12</span> 辅助调试</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li>NDEBUG 宏</li>
<li>assert 宏</li>
</ul>
</div>
<div id="outline-container-org46e31c1" class="outline-3">
<h3 id="org46e31c1"><span class="section-number-3">12.1</span> 辅助变量</h3>
<div class="outline-text-3" id="text-12-1">
<pre class="example">
__func__, __FILE__, __LINE__, __TIME__, __DATE__
</pre>
</div>
</div>
</div>
<div id="outline-container-org61e4279" class="outline-2">
<h2 id="org61e4279"><span class="section-number-2">13</span> 输入输出流</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orga09db34" class="outline-3">
<h3 id="orga09db34"><span class="section-number-3">13.1</span> 缓冲区控制</h3>
<div class="outline-text-3" id="text-13-1">
<ul class="org-ul">
<li>endl: 输出一个换行符并刷新缓冲区</li>
<li>flush: 直接刷新缓冲区</li>
<li>ends: 输出一个'\0' 并刷新缓冲区</li>
<li>unitbuf: 设定输出流为每次写入直接刷新缓冲区</li>
</ul>
</div>
</div>
<div id="outline-container-org818dc6f" class="outline-3">
<h3 id="org818dc6f"><span class="section-number-3">13.2</span> tie 关联输出流</h3>
<div class="outline-text-3" id="text-13-2">
<p>
例如标准输入流 cin 会关联标准输出流 cout，cin 会刷新 cout 的状态
</p>
<div class="org-src-container">
<pre class="src src-cpp">cin.tie(&amp;cout);
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7f070c9" class="outline-2">
<h2 id="org7f070c9"><span class="section-number-2">14</span> string</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-orga36ddeb" class="outline-3">
<h3 id="orga36ddeb"><span class="section-number-3">14.1</span> 例子：特定字符搜索</h3>
<div class="outline-text-3" id="text-14-1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">string</span> <span style="color: #715ab1;">name</span> = <span style="color: #2d9574;">"r1b5"</span>;
<span style="color: #ba2f59; font-weight: bold;">string</span> <span style="color: #715ab1;">numbers</span> = <span style="color: #2d9574;">"0123456789"</span>;
<span style="color: #4e3163;">string</span>::<span style="color: #ba2f59; font-weight: bold;">size_type</span> <span style="color: #715ab1;">pos</span> = 0;
<span style="color: #3a81c3; font-weight: bold;">while</span> ((pos = name.find_first_of(numbers, pos)) != <span style="color: #4e3163;">string</span>::npos) {
  <span style="color: #4e3163;">std</span>::cout &lt;&lt; name[pos] &lt;&lt; <span style="color: #2d9574;">"\n"</span>;
  ++pos;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd736876" class="outline-3">
<h3 id="orgd736876"><span class="section-number-3">14.2</span> 数值转换</h3>
<div class="outline-text-3" id="text-14-2">
<ul class="org-ul">
<li>std::to_string</li>
<li>stoXXX</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2f82e50" class="outline-2">
<h2 id="org2f82e50"><span class="section-number-2">15</span> new &amp; delete</h2>
<div class="outline-text-2" id="text-15">
<ul class="org-ul">
<li>可重载 new 和 delete 操作符以控制 <b>内存分配</b></li>
<li>无法改变 <b>运算符</b> new 和 delete 的行为
<ul class="org-ul">
<li>运算符 new 的操作：1) 调用 operator new 获取内存空间 2) 在内存空间中使用构造函数构造对象</li>
<li>运算符 delete：1) 调用析构销毁对象 2) 调用 operator delete 回收内存空间</li>
</ul></li>
</ul>
</div>
<div id="outline-container-orgf41edd8" class="outline-3">
<h3 id="orgf41edd8"><span class="section-number-3">15.1</span> placement new</h3>
<div class="outline-text-3" id="text-15-1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">int</span> *<span style="color: #715ab1;">p</span> = <span style="color: #3a81c3; font-weight: bold;">new</span> (nothrow) <span style="color: #ba2f59; font-weight: bold;">int</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">placement new, &#19981;&#25243;&#20986;&#24322;&#24120;&#65292;&#21019;&#24314;&#22833;&#36133;&#21017;&#36820;&#22238; nullptr</span>
</pre>
</div>
<p>
也可以是如下形式：
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">new</span> (place_address) <span style="color: #ba2f59; font-weight: bold;">type</span>
</pre>
</div>
<p>
place_address 指定一个事先分配好内存的指针
</p>
<ul class="org-ul">
<li>placement new 类似于 allocator 的 construct 成员</li>
</ul>
</div>
</div>
<div id="outline-container-org2fe9ceb" class="outline-3">
<h3 id="org2fe9ceb"><span class="section-number-3">15.2</span> 标准库 allocator</h3>
<div class="outline-text-3" id="text-15-2">
<ul class="org-ul">
<li>allocate</li>
<li>deallocate</li>
<li>construct</li>
<li>destroy</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org855b9d8" class="outline-2">
<h2 id="org855b9d8"><span class="section-number-2">16</span> 异常</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-org1472baf" class="outline-3">
<h3 id="org1472baf"><span class="section-number-3">16.1</span> 构造函数处理异常</h3>
<div class="outline-text-3" id="text-16-1">
<p>
需要声明成函数 try 语句块，这样才能捕获构造函数的初始化过程
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4e3163;">Foo</span>::Foo(<span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">i</span>) <span style="color: #3a81c3; font-weight: bold;">try</span> : i_(i) {}
</pre>
</div>
</div>
</div>
</div>
